#include <stdio.h>
main() 
{ 
int x,x1,x2,x3,x4;/*我用的不知算不算是穷举法，桃子的初值设的是１００*/

 for(x=100;x<10000;x++)     /*在１００－１００００之间查找，还可以设的更大些*/ 
  { if((x-1)%5==0)    /*满足第一只猴子的条件*/
      {x1=(x-1)-(x-1)/5; 
if((x1-1)%5==0)    /*这里就是满足第二只猴子的条件*/
 { x2=(x1-1)-(x1-1)/5; 
   if((x2-1)%5==0)    /*满足第三只猴子的条件*/ 
    { x3=(x2-1)-(x2-1)/5; 
      if((x3-1)%5==0)    /*满足第四只猴子的条件*/
{ x4=(x3-1)-(x3-1)/5;   
                if((x4-1)%5==0)    /*满足第五只猴子的条件*/
    { 
      printf("%d\n",x);    /*＜－  还可以在这里设置满足六，七，八等猴子的条件*/ 
    } 
} 
    }                                                                     
 } 
      } 

  } 
}
 